Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>FLEX_US_CSR_LIN_MODE_MODE</name>
               <description>USART Channel Status Register</description>
               <alternateRegister>FLEX_US_CSR</alternateRegister>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXRDY</name>
                     <description>Receiver Ready (cleared by reading FLEX_US_RHR)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXRDY</name>
                     <description>Transmitter Ready (cleared by writing FLEX_US_THR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVRE</name>
                     <description>Overrun Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRAME</name>
                     <description>Framing Error</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PARE</name>
                     <description>Parity Error</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Receiver Timeout</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXEMPTY</name>
                     <description>Transmitter Empty (cleared by writing FLEX_US_THR)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBK</name>
                     <description>LIN Break Sent or LIN Break Received</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINID</name>
                     <description>LIN Identifier Sent or LIN Identifier Received</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINTC</name>
                     <description>LIN Transfer Completed</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBLS</name>
                     <description>LIN Bus Line Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINBE</name>
                     <description>LIN Bit Error</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINISFE</name>
                     <description>LIN Inconsistent Synch Field Error</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINIPE</name>
                     <description>LIN Identifier Parity Error</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINCE</name>
                     <description>LIN Checksum Error</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINSNRE</name>
                     <description>LIN Slave Not Responding Error</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINSTE</name>
                     <description>LIN Synch Tolerance Error</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LINHTE</name>
                     <description>LIN Header Timeout Error</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_RHR</name>
               <description>USART Receive Holding Register</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXCHR</name>
                     <description>Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>RXSYNH</name>
                     <description>Received Sync</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_RHR_FIFO_MULTI_DATA_MODE</name>
               <description>USART Receive Holding Register</description>
               <alternateRegister>FLEX_US_RHR</alternateRegister>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXCHR0</name>
                     <description>Received Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXCHR1</name>
                     <description>Received Character</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXCHR2</name>
                     <description>Received Character</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>RXCHR3</name>
                     <description>Received Character</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_THR</name>
               <description>USART Transmit Holding Register</description>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXCHR</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>TXSYNH</name>
                     <description>Sync Field to be Transmitted</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_THR_FIFO_MULTI_DATA_MODE</name>
               <description>USART Transmit Holding Register</description>
               <alternateRegister>FLEX_US_THR</alternateRegister>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TXCHR0</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXCHR1</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXCHR2</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>TXCHR3</name>
                     <description>Character to be Transmitted</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_BRGR</name>
               <description>USART Baud Rate Generator Register</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CD</name>
                     <description>Clock Divider</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FP</name>
                     <description>Fractional Part</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_RTOR</name>
               <description>USART Receiver Timeout Register</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TO</name>
                     <description>Timeout Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>17</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_TTGR</name>
               <description>USART Transmitter Timeguard Register</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TG</name>
                     <description>Timeguard Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_FIDI</name>
               <description>USART FI DI Ratio Register</description>
               <addressOffset>0x240</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FI_DI_RATIO</name>
                     <description>FI Over DI Ratio Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_NER</name>
               <description>USART Number of Errors Register</description>
               <addressOffset>0x244</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NB_ERRORS</name>
                     <description>Number of Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_IF</name>
               <description>USART IrDA Filter Register</description>
               <addressOffset>0x24C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IRDA_FILTER</name>
                     <description>IrDA Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_MAN</name>
               <description>USART Manchester Configuration Register</description>
               <addressOffset>0x250</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TX_PL</name>
                     <description>Transmitter Preamble Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TX_PP</name>
                     <description>Transmitter Preamble Pattern</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TX_PPSelect</name>
                        <enumeratedValue>
                           <name>ALL_ONE</name>
                           <description>The preamble is composed of '1's</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL_ZERO</name>
                           <description>The preamble is composed of '0's</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZERO_ONE</name>
                           <description>The preamble is composed of '01's</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE_ZERO</name>
                           <description>The preamble is composed of '10's</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX_MPOL</name>
                     <description>Transmitter Manchester Polarity</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_PL</name>
                     <description>Receiver Preamble Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RX_PP</name>
                     <description>Receiver Preamble Pattern detected</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>RX_PPSelect</name>
                        <enumeratedValue>
                           <name>ALL_ONE</name>
                           <description>The preamble is composed of '1's</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALL_ZERO</name>
                           <description>The preamble is composed of '0's</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ZERO_ONE</name>
                           <description>The preamble is composed of '01's</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE_ZERO</name>
                           <description>The preamble is composed of '10's</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX_MPOL</name>
                     <description>Receiver Manchester Polarity</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONE</name>
                     <description>Must Be Set to 1</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DRIFT</name>
                     <description>Drift Compensation</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXIDLEV</name>
                     <description>Receiver Idle Value</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_LINMR</name>
               <description>USART LIN Mode Register</description>
               <addressOffset>0x254</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NACT</name>
                     <description>LIN Node Action</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NACTSelect</name>
                        <enumeratedValue>
                           <name>PUBLISH</name>
                           <description>The USART transmits the response.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUBSCRIBE</name>
                           <description>The USART receives the response.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IGNORE</name>
                           <description>The USART does not transmit and does not receive the response.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PARDIS</name>
                     <description>Parity Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHKDIS</name>
                     <description>Checksum Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHKTYP</name>
                     <description>Checksum Type</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLM</name>
                     <description>Data Length Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSDIS</name>
                     <description>Frame Slot Mode Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WKUPTYP</name>
                     <description>Wakeup Signal Type</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DLC</name>
                     <description>Data Length Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PDCM</name>
                     <description>DMAC Mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SYNCDIS</name>
                     <description>Synchronization Disable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_LINIR</name>
               <description>USART LIN Identifier Register</description>
               <addressOffset>0x258</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IDCHR</name>
                     <description>Identifier Character</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEX_US_LINBRR</name>
               <description>USART LIN Baud Rate Register</description>
               <addressOffset>0x25C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LINCD</name>
                     <description>Clock Divider after Synchronization</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>LINFP</name>
                     <description>Fractional Part after Synchronization</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
