Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM1</name>
         <baseAddress>0x40014000</baseAddress>
         <interrupt>
            <name>FLEXCOM1</name>
            <value>8</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM2</name>
         <baseAddress>0x40018000</baseAddress>
         <interrupt>
            <name>FLEXCOM2</name>
            <value>13</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM3</name>
         <baseAddress>0x4001C000</baseAddress>
         <interrupt>
            <name>FLEXCOM3</name>
            <value>14</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM4</name>
         <baseAddress>0x40020000</baseAddress>
         <interrupt>
            <name>FLEXCOM4</name>
            <value>15</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM5</name>
         <baseAddress>0x40024000</baseAddress>
         <interrupt>
            <name>FLEXCOM5</name>
            <value>22</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM6</name>
         <baseAddress>0x40028000</baseAddress>
         <interrupt>
            <name>FLEXCOM6</name>
            <value>23</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM7</name>
         <baseAddress>0x4002C000</baseAddress>
         <interrupt>
            <name>FLEXCOM7</name>
            <value>24</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM8</name>
         <baseAddress>0x40030000</baseAddress>
         <interrupt>
            <name>FLEXCOM8</name>
            <value>45</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM9</name>
         <baseAddress>0x40034000</baseAddress>
         <interrupt>
            <name>FLEXCOM9</name>
            <value>46</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>FLEXRAMECC</name>
         <version>44124A</version>
         <description>FLEXRAMECC</description>
         <groupName>FLEXRAMECC</groupName>
         <prependToName>FLEXRAMECC_</prependToName>
         <baseAddress>0x40100600</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLEXRAM_INTFIX</name>
            <value>42</value>
         </interrupt>
         <interrupt>
            <name>FLEXRAM_INTNOFIX</name>
            <value>43</value>
         </interrupt>
         <registers>
            <register>
               <name>FLEXRAMECC_CR</name>
               <description>FLEXRAMECC Control Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXRAMECC_TESTCB1</name>
               <description>FLEXRAMECC Test mode register 1</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
            </register>
            <register>
               <name>FLEXRAMECC_SR</name>
               <description>FLEXRAMECC Status register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_FIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_FIX</name>
                     <description>counter overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_NOFIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_NOFIX</name>
                     <description>counter overflow</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HES</name>
                     <description>Hardware Error Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>write or read access</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXRAMECC_IER</name>
               <description>FLEXRAMECC Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXRAMECC_IDR</name>
               <description>FLEXRAMECC Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXRAMECC_IMR</name>
               <description>FLEXRAMECC Interrupt Mask Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXRAMECC_FAILAR</name>
               <description>FLEXRAMECC Fail address register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>address of the error detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
