Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HEFC</name>
         <version>44123A</version>
         <description>Harden Embedded Flash Controller</description>
         <groupName>HEFC</groupName>
         <prependToName>HEFC_</prependToName>
         <baseAddress>0x40004000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x194</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HEFC_INT0</name>
            <value>50</value>
         </interrupt>
         <interrupt>
            <name>HEFC_INTFIX</name>
            <value>51</value>
         </interrupt>
         <interrupt>
            <name>HEFC_INTNOFIX</name>
            <value>52</value>
         </interrupt>
         <registers>
            <register>
               <name>HEFC_FMR</name>
               <description>HEFC Flash Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FRDY</name>
                     <description>Flash Ready Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FPSI</name>
                     <description>Flash Power Status Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONE</name>
                     <description>Must be written to 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_FCR</name>
               <description>HEFC Flash Command Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>FCMD</name>
                     <description>Flash Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FCMDSelect</name>
                        <enumeratedValue>
                           <name>GETD</name>
                           <description>Get Flash descriptor</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WP</name>
                           <description>Write page</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WPL</name>
                           <description>Write page and lock</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EA</name>
                           <description>Erase all</description>
                           <value>0x05</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EP</name>
                           <description>Erase page</description>
                           <value>0x06</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EPA</name>
                           <description>Erase pages</description>
                           <value>0x07</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLB</name>
                           <description>Set lock bit</description>
                           <value>0x08</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLB</name>
                           <description>Clear lock bit</description>
                           <value>0x09</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GLB</name>
                           <description>Get lock bit</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SGPB</name>
                           <description>Set GPNVM bit</description>
                           <value>0x0B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CGPB</name>
                           <description>Clear GPNVM bit</description>
                           <value>0x0C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GGPB</name>
                           <description>Get GPNVM bit</description>
                           <value>0x0D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GCALB</name>
                           <description>Get CALIB bit</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WUS</name>
                           <description>Write user signature</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EUS</name>
                           <description>Erase user signature</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>STUS</name>
                           <description>Start read user signature</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPUS</name>
                           <description>Stop read user signature</description>
                           <value>0x15</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FARG</name>
                     <description>Flash Command Argument</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>FKEY</name>
                     <description>Flash Writing Protection Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>FKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started.</description>
                           <value>0x5A</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_FSR</name>
               <description>HEFC Flash Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRDY</name>
                     <description>Flash Ready Status (cleared when Flash is busy)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FCMDE</name>
                     <description>Flash Command Error Status (cleared on read or by writing HEFC_FCR)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLOCKE</name>
                     <description>Flash Lock Error Status (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WREER</name>
                     <description>Write Register Error Status (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_FRR</name>
               <description>HEFC Flash Result Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FVALUE</name>
                     <description>Flash Result Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_FPMR</name>
               <description>HEFC Flash Power Management Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PWS_EN</name>
                     <description>Power switch enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWS_STAT</name>
                     <description>Power switch Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWS_DLY</name>
                     <description>Power switch Delay</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>PWS_DLYSelect</name>
                        <enumeratedValue>
                           <name>_75US</name>
                           <description>delay is set to 75 usec</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_150US</name>
                           <description>delay is set to 150 usec</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_300US</name>
                           <description>delay is set to 300 usec</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_600US</name>
                           <description>delay is set to 600 usec</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VAR_FACTOR</name>
                     <description>Variation Factor</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>FUNC_ISOL_CTRL_N</name>
                     <description>Flash insulated Control Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPNVMWP</name>
                     <description>GPNVM Bit Write Protection</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LOCKWP</name>
                     <description>Lock Bit Write Protection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ERASEWP</name>
                     <description>Page, Sector and Plane Write Protection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>User Signature Write Protection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0x454643</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_CR0</name>
               <description>HECC Control Register ChannelNumbers (ChannelNumbers = 0) 0</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_CR1</name>
               <description>HECC Control Register ChannelNumbers (ChannelNumbers = 0) 1</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_CR2</name>
               <description>HECC Control Register ChannelNumbers (ChannelNumbers = 0) 2</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_CR3</name>
               <description>HECC Control Register ChannelNumbers (ChannelNumbers = 0) 3</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
