Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>HEFC_HECC_TESTCB1</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 1</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB2</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 2</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB3</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 3</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB4</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 4</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB5</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 5</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB6</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 6</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB7</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 7</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB8</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 8</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB9</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 9</description>
               <addressOffset>0x164</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB10</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 10</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB11</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 11</description>
               <addressOffset>0x16C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB12</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 12</description>
               <addressOffset>0x170</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB13</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 13</description>
               <addressOffset>0x174</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB14</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 14</description>
               <addressOffset>0x178</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_TESTCB15</name>
               <description>HECC Test mode ChannelNumbers (ChannelNumbers = 0) 15</description>
               <addressOffset>0x17C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_SR</name>
               <description>HECC Status register</description>
               <addressOffset>0x180</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_FIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_FIX</name>
                     <description>counter overflow</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPT_NOFIX</name>
                     <description>5 bits counter</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>OVER_NOFIX</name>
                     <description>counter overflow</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HES</name>
                     <description>Hardware Error Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TYPE</name>
                     <description>write or read access</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_ID</name>
                     <description>memory identification number</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_IER</name>
               <description>HECC Interrupt Enable Register</description>
               <addressOffset>0x184</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>Fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>Un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_IDR</name>
               <description>HECC Interrupt Disable Register</description>
               <addressOffset>0x188</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_IMR</name>
               <description>HECC Interrupt Mask Register</description>
               <addressOffset>0x18C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MEM_FIX</name>
                     <description>fixable error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MEM_NOFIX</name>
                     <description>un-fixable error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEFC_HECC_FAILAR</name>
               <description>HECC Fail address register</description>
               <addressOffset>0x190</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDRESS</name>
                     <description>address of the error detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
