Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>HEMC_HECC_CR7</name>
               <description>HECC Control Register (ChannelNumbers = 0) 7</description>
               <addressOffset>0x11C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR8</name>
               <description>HECC Control Register (ChannelNumbers = 0) 8</description>
               <addressOffset>0x120</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR9</name>
               <description>HECC Control Register (ChannelNumbers = 0) 9</description>
               <addressOffset>0x124</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR10</name>
               <description>HECC Control Register (ChannelNumbers = 0) 10</description>
               <addressOffset>0x128</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR11</name>
               <description>HECC Control Register (ChannelNumbers = 0) 11</description>
               <addressOffset>0x12C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR12</name>
               <description>HECC Control Register (ChannelNumbers = 0) 12</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR13</name>
               <description>HECC Control Register (ChannelNumbers = 0) 13</description>
               <addressOffset>0x134</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR14</name>
               <description>HECC Control Register (ChannelNumbers = 0) 14</description>
               <addressOffset>0x138</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_CR15</name>
               <description>HECC Control Register (ChannelNumbers = 0) 15</description>
               <addressOffset>0x13C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>ECC protection enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_RD</name>
                     <description>test mode of ECC protection - read mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TEST_MODE_WR</name>
                     <description>test mode of ECC protection - write mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_FIX_CPT</name>
                     <description>reset the fixable error counter</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RST_NOFIX_CPT</name>
                     <description>reset the un-fixable error counter</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECC12_ENABLE</name>
                     <description>BCH ECC enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB0</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 0</description>
               <addressOffset>0x140</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB1</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 1</description>
               <addressOffset>0x144</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB2</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 2</description>
               <addressOffset>0x148</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB3</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 3</description>
               <addressOffset>0x14C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB4</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 4</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB5</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 5</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB6</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 6</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB7</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 7</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB8</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 8</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB9</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 9</description>
               <addressOffset>0x164</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HEMC_HECC_TESTCB10</name>
               <description>HECC Test mode Register (ChannelNumbers = 0) 10</description>
               <addressOffset>0x168</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCB1</name>
                     <description>test check bit (16 bit)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
