Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>HSDRAMC</name>
         <version>44129A</version>
         <description>Hardened SDRAM Controller</description>
         <groupName>HSDRAMC</groupName>
         <prependToName>HSDRAMC_</prependToName>
         <baseAddress>0x40082000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>HSDRAMC_MR</name>
               <description>Mode Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>SDRAMC Command Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MODESelect</name>
                        <enumeratedValue>
                           <name>NORMAL</name>
                           <description>Normal mode. Any access to the SDRAM is decoded normally. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOP</name>
                           <description>The SDRAMC issues a NOP command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALLBANKS_PRECHARGE</name>
                           <description>The SDRAMC issues an 'All Banks Precharge' command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOAD_MODEREG</name>
                           <description>The SDRAMC issues a 'Load Mode Register' command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AUTO_REFRESH</name>
                           <description>The SDRAMC issues an 'Autorefresh' Command when the SDRAM device is accessed regardless of the cycle. Previously, an 'All Banks Precharge' command must be issued. To activate this mode, the command must be followed by a write to the SDRAM.</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EXT_LOAD_MODEREG</name>
                           <description>The SDRAMC issues an 'Extended Load Mode Register' command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the 'Extended Load Mode Register' command must be followed by a write to the SDRAM. The write in the SDRAM must be done in the appropriate bank; most low-power SDRAM devices use the bank 1.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_TR</name>
               <description>Refresh Timer Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>COUNT</name>
                     <description>SDRAMC Refresh Timer Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_CR</name>
               <description>Configuration Register</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NC</name>
                     <description>Number of Column Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>NCSelect</name>
                        <enumeratedValue>
                           <name>COL8</name>
                           <description>8 bits to define the column number, up to 256 columns</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COL9</name>
                           <description>9 bits to define the column number, up to 512 columns</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COL10</name>
                           <description>10 bits to define the column number, up to 1024 columns</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COL11</name>
                           <description>11 bits to define the column number, up to 2048 columns</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COL12</name>
                           <description>12 bits to define the column number, up to 4096 columns</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NR</name>
                     <description>Number of Row Bits</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NRSelect</name>
                        <enumeratedValue>
                           <name>ROW11</name>
                           <description>11 bits to define the row number, up to 2048 rows</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROW12</name>
                           <description>12 bits to define the row number, up to 4096 rows</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ROW13</name>
                           <description>13 bits to define the row number, up to 8192 rows</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NB</name>
                     <description>Number of Banks</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>NBSelect</name>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>2 banks</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK4</name>
                           <description>4 banks</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAS</name>
                     <description>CAS Latency</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CASSelect</name>
                        <enumeratedValue>
                           <name>LATENCY1</name>
                           <description>1 cycle latency</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LATENCY2</name>
                           <description>2 cycle latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LATENCY3</name>
                           <description>3 cycle latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW</name>
                     <description>Read Modify Write</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_SDR</name>
               <description>Setup Delay Register</description>
               <addressOffset>0x000C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TWR</name>
                     <description>Write Recovery Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRC_TRFC</name>
                     <description>Row Cycle Delay and Row Refresh Cycle</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRP</name>
                     <description>Row Precharge Delay</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRCD</name>
                     <description>Row to Column Delay</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TRAS</name>
                     <description>Active to Precharge Delay</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXSR</name>
                     <description>Exit Self-Refresh to Active Delay</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x0014</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RES</name>
                     <description>Refresh Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x0018</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RES</name>
                     <description>Refresh Error Interrupt Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RES</name>
                     <description>Refresh Error Interrupt Mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RES</name>
                     <description>Refresh Error Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_CFR1</name>
               <description>Configuration Register 1</description>
               <addressOffset>0x0024</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TMRD</name>
                     <description>Load Mode Register Command to Active or Refresh Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UNAL</name>
                     <description>Support Unaligned Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNALSelect</name>
                        <enumeratedValue>
                           <name>UNSUPPORTED</name>
                           <description>Unaligned access is not supported.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUPPORTED</name>
                           <description>Unaligned access is supported.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x0028</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x534452</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSDRAMC_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x002C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
