Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>HSMC_PULSE3</name>
               <description>HSMC Pulse Register (CS_number = 3)</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE3</name>
               <description>HSMC Cycle Register (CS_number = 3)</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE3</name>
               <description>HSMC Mode Register (CS_number = 3)</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SETUP4</name>
               <description>HSMC Setup Register (CS_number = 4)</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PULSE4</name>
               <description>HSMC Pulse Register (CS_number = 4)</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE4</name>
               <description>HSMC Cycle Register (CS_number = 4)</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE4</name>
               <description>HSMC Mode Register (CS_number = 4)</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_SETUP5</name>
               <description>HSMC Setup Register (CS_number = 5)</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_SETUP</name>
                     <description>NWE Setup Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_SETUP</name>
                     <description>NCS Setup Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NRD_SETUP</name>
                     <description>NRD Setup Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_SETUP</name>
                     <description>NCS Setup Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_PULSE5</name>
               <description>HSMC Pulse Register (CS_number = 5)</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_PULSE</name>
                     <description>NWE Pulse Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_WR_PULSE</name>
                     <description>NCS Pulse Length in WRITE Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NRD_PULSE</name>
                     <description>NRD Pulse Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>NCS_RD_PULSE</name>
                     <description>NCS Pulse Length in READ Access</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_CYCLE5</name>
               <description>HSMC Cycle Register (CS_number = 5)</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NWE_CYCLE</name>
                     <description>Total Write Cycle Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>NRD_CYCLE</name>
                     <description>Total Read Cycle Length</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_MODE5</name>
               <description>HSMC Mode Register (CS_number = 5)</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>READ_MODE</name>
                     <description>Read Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WRITE_MODE</name>
                     <description>Write Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMW_ENABLE</name>
                     <description>Read-Modify Write enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXNW_MODE</name>
                     <description>NWAIT Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EXNW_MODESelect</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FROZEN</name>
                           <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>READY</name>
                           <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBW</name>
                     <description>Data Bus Width</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBWSelect</name>
                        <enumeratedValue>
                           <name>_8_BIT</name>
                           <description>8-bit Data Bus</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BIT</name>
                           <description>16-bit Data Bus</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BIT</name>
                           <description>32-bit Data Bus</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_WPMR</name>
               <description>HSMC Write Protection Mode Register</description>
               <addressOffset>0x0070</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>HSMC_WPSR</name>
               <description>HSMC Write Protection Status Register</description>
               <addressOffset>0x0074</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
