Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>MATRIX_PASSR5</name>
               <description>Protected Areas Split Slave 0 Register 5</description>
               <addressOffset>0x254</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR6</name>
               <description>Protected Areas Split Slave 0 Register 6</description>
               <addressOffset>0x258</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR7</name>
               <description>Protected Areas Split Slave 0 Register 7</description>
               <addressOffset>0x25C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR8</name>
               <description>Protected Areas Split Slave 0 Register 8</description>
               <addressOffset>0x260</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR9</name>
               <description>Protected Areas Split Slave 0 Register 9</description>
               <addressOffset>0x264</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR10</name>
               <description>Protected Areas Split Slave 0 Register 10</description>
               <addressOffset>0x268</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR11</name>
               <description>Protected Areas Split Slave 0 Register 11</description>
               <addressOffset>0x26C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR12</name>
               <description>Protected Areas Split Slave 0 Register 12</description>
               <addressOffset>0x270</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PASSR13</name>
               <description>Protected Areas Split Slave 0 Register 13</description>
               <addressOffset>0x274</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PASPLIT0</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT1</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT2</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT3</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT4</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT5</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT6</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PASPLIT7</name>
                     <description>Protected Areas Split for HSELx Protected Region</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
