Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>MATRIX_PRTSR7</name>
               <description>Protected Region Top Slave 0 Register 7</description>
               <addressOffset>0x29C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR8</name>
               <description>Protected Region Top Slave 0 Register 8</description>
               <addressOffset>0x2A0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR9</name>
               <description>Protected Region Top Slave 0 Register 9</description>
               <addressOffset>0x2A4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR10</name>
               <description>Protected Region Top Slave 0 Register 10</description>
               <addressOffset>0x2A8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR11</name>
               <description>Protected Region Top Slave 0 Register 11</description>
               <addressOffset>0x2AC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR12</name>
               <description>Protected Region Top Slave 0 Register 12</description>
               <addressOffset>0x2B0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR13</name>
               <description>Protected Region Top Slave 0 Register 13</description>
               <addressOffset>0x2B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR14</name>
               <description>Protected Region Top Slave 0 Register 14</description>
               <addressOffset>0x2B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MATRIX_PRTSR15</name>
               <description>Protected Region Top Slave 0 Register 15</description>
               <addressOffset>0x2BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PRTOP0</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP1</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP2</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP3</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP4</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP5</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP6</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PRTOP7</name>
                     <description>HSELx Protected Region Top</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
