Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="MCAN0">
         <name>MCAN1</name>
         <baseAddress>0x4005C000</baseAddress>
         <interrupt>
            <name>MCAN1_INT0</name>
            <value>38</value>
         </interrupt>
         <interrupt>
            <name>MCAN1_INT1</name>
            <value>39</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>NMIC</name>
         <version>44062A</version>
         <description>Non-maskable Interrupt Controller</description>
         <groupName>NMIC</groupName>
         <prependToName>NMIC_</prependToName>
         <baseAddress>0x400A8000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xEC</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>NMIC</name>
            <value>9</value>
         </interrupt>
         <registers>
            <register>
               <name>NMIC_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>NMI0</name>
                     <description>Non-maskable Interrupt 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI1</name>
                     <description>Non-maskable Interrupt 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI2</name>
                     <description>Non-maskable Interrupt 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI3</name>
                     <description>Non-maskable Interrupt 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI4</name>
                     <description>Non-maskable Interrupt 4 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI5</name>
                     <description>Non-maskable Interrupt 5 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI6</name>
                     <description>Non-maskable Interrupt 6 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI7</name>
                     <description>Non-maskable Interrupt 7 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI8</name>
                     <description>Non-maskable Interrupt 8 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>NMI0</name>
                     <description>Non-maskable Interrupt 0 Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI1</name>
                     <description>Non-maskable Interrupt 1 Disable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI2</name>
                     <description>Non-maskable Interrupt 2 Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI3</name>
                     <description>Non-maskable Interrupt 3 Disable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI4</name>
                     <description>Non-maskable Interrupt 4 Disable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI5</name>
                     <description>Non-maskable Interrupt 5 Disable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI6</name>
                     <description>Non-maskable Interrupt 6 Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI7</name>
                     <description>Non-maskable Interrupt 7 Disable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI8</name>
                     <description>Non-maskable Interrupt 8 Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_IAR</name>
               <description>Interrupt Active Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NMI0</name>
                     <description>Active Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI1</name>
                     <description>Active Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI2</name>
                     <description>Active Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI3</name>
                     <description>Active Interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI4</name>
                     <description>Active Interrupt 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI5</name>
                     <description>Active Interrupt 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI6</name>
                     <description>Active Interrupt 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI7</name>
                     <description>Active Interrupt 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI8</name>
                     <description>Active Interrupt 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>NMI0</name>
                     <description>Non-maskable Interrupt Source 0 Pending (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI1</name>
                     <description>Non-maskable Interrupt Source 1 Pending (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI2</name>
                     <description>Non-maskable Interrupt Source 2 Pending (cleared on read)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI3</name>
                     <description>Non-maskable Interrupt Source 3 Pending (cleared on read)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI4</name>
                     <description>Non-maskable Interrupt Source 4 Pending (cleared on read)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI5</name>
                     <description>Non-maskable Interrupt Source 5 Pending (cleared on read)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI6</name>
                     <description>Non-maskable Interrupt Source 6 Pending (cleared on read)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI7</name>
                     <description>Non-maskable Interrupt Source 7 Pending (cleared on read)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI8</name>
                     <description>Non-maskable Interrupt Source 8 Pending (cleared on read)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI9</name>
                     <description>Non-maskable Interrupt Source 9 Pending (cleared on read)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI10</name>
                     <description>Non-maskable Interrupt Source 10 Pending (cleared on read)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI11</name>
                     <description>Non-maskable Interrupt Source 11 Pending (cleared on read)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI12</name>
                     <description>Non-maskable Interrupt Source 12 Pending (cleared on read)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI13</name>
                     <description>Non-maskable Interrupt Source 13 Pending (cleared on read)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI14</name>
                     <description>Non-maskable Interrupt Source 14 Pending (cleared on read)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NMI15</name>
                     <description>Non-maskable Interrupt Source 15 Pending (cleared on read)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_GFCS</name>
               <description>Glitch Filter Configuration Status Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RDY0</name>
                     <description>Filter 0 Configuration Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY1</name>
                     <description>Filter 1 Configuration Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY2</name>
                     <description>Filter 2 Configuration Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY3</name>
                     <description>Filter 3 Configuration Ready</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY4</name>
                     <description>Filter 4 Configuration Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY5</name>
                     <description>Filter 5 Configuration Ready</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY6</name>
                     <description>Filter 6 Configuration Ready</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY7</name>
                     <description>Filter 7 Configuration Ready</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY8</name>
                     <description>Filter 8 Configuration Ready</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY9</name>
                     <description>Filter 9 Configuration Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY10</name>
                     <description>Filter 10 Configuration Ready</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY11</name>
                     <description>Filter 11 Configuration Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY12</name>
                     <description>Filter 12 Configuration Ready</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY13</name>
                     <description>Filter 13 Configuration Ready</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY14</name>
                     <description>Filter 14 Configuration Ready</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RDY15</name>
                     <description>Filter 15 Configuration Ready</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_SCFGxR0</name>
               <description>Source Configuration Register 0 0</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMIC_SCFGxR1</name>
               <description>Source Configuration Register 0 1</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GFSEL</name>
                     <description>Glitch Filter Selector (GFSEL field is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>GFEN</name>
                     <description>Glitch Filter Enable (GFEN bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity (POL bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Level Detection (LVL bit is read-only in NMIC_SCFG0 to 8)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Source Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Interrupt Line Freeze</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
