Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>RTT</name>
         <version>6081N</version>
         <description>Real-time Timer</description>
         <groupName>RTT</groupName>
         <prependToName>RTT_</prependToName>
         <baseAddress>0x40100230</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>RTT</name>
            <value>3</value>
         </interrupt>
         <registers>
            <register>
               <name>RTT_MR</name>
               <description>Mode Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>RTPRES</name>
                     <description>Real-time Timer Prescaler Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>ALMIEN</name>
                     <description>Alarm Interrupt Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINCIEN</name>
                     <description>Real-time Timer Increment Interrupt Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTRST</name>
                     <description>Real-time Timer Restart</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTDIS</name>
                     <description>Real-time Timer Disable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTC1HZ</name>
                     <description>Real-Time Clock 1Hz Clock Selection</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTT_AR</name>
               <description>Alarm Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ALMV</name>
                     <description>Alarm Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTT_VR</name>
               <description>Value Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CRTV</name>
                     <description>Current Real-time Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RTT_SR</name>
               <description>Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ALMS</name>
                     <description>Real-time Alarm Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RTTINC</name>
                     <description>Prescaler Roll-over Status (cleared on read)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SFR</name>
         <version>11066S</version>
         <description>Special Function Registers</description>
         <groupName>SFR</groupName>
         <prependToName>SFR_</prependToName>
         <baseAddress>0x400A0000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xA8</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SFR</name>
            <value>62</value>
         </interrupt>
         <registers>
            <register>
               <name>SFR_SECURE</name>
               <description>Security Configuration Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ROM</name>
                     <description>Disable Access to ROM Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFR_CAN0</name>
               <description>CAN0 MSB Base Address 0</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EXT_MEM_ADDR</name>
                     <description>MSB Base Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SFR_CAN1</name>
               <description>CAN0 MSB Base Address 1</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EXT_MEM_ADDR</name>
                     <description>MSB Base Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
