Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>SHA_IDATAR11</name>
               <description>Input Data 0 Register 11</description>
               <addressOffset>0x6C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IDATAR12</name>
               <description>Input Data 0 Register 12</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IDATAR13</name>
               <description>Input Data 0 Register 13</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IDATAR14</name>
               <description>Input Data 0 Register 14</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IDATAR15</name>
               <description>Input Data 0 Register 15</description>
               <addressOffset>0x7C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR0</name>
               <description>Input/Output Data 0 Register 0</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR1</name>
               <description>Input/Output Data 0 Register 1</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR2</name>
               <description>Input/Output Data 0 Register 2</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR3</name>
               <description>Input/Output Data 0 Register 3</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR4</name>
               <description>Input/Output Data 0 Register 4</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR5</name>
               <description>Input/Output Data 0 Register 5</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR6</name>
               <description>Input/Output Data 0 Register 6</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR7</name>
               <description>Input/Output Data 0 Register 7</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR8</name>
               <description>Input/Output Data 0 Register 8</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR9</name>
               <description>Input/Output Data 0 Register 9</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR10</name>
               <description>Input/Output Data 0 Register 10</description>
               <addressOffset>0xA8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR11</name>
               <description>Input/Output Data 0 Register 11</description>
               <addressOffset>0xAC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR12</name>
               <description>Input/Output Data 0 Register 12</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR13</name>
               <description>Input/Output Data 0 Register 13</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR14</name>
               <description>Input/Output Data 0 Register 14</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_IODATAR15</name>
               <description>Input/Output Data 0 Register 15</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>IODATA</name>
                     <description>Input/Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Configuration Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPITEN</name>
                     <description>Write Protection Interruption Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPCREN</name>
                     <description>Write Protection Control Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN,WPITEN,WPCREN bits.Always reads as 0.</description>
                           <value>0x534841</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status (cleared on read)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
