Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SPW</name>
         <version>44126A</version>
         <description>SpW</description>
         <groupName>SPW</groupName>
         <prependToName>SPW_</prependToName>
         <baseAddress>0x40040000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xF0C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SPW_INT0</name>
            <value>65</value>
         </interrupt>
         <interrupt>
            <name>SPW_INT1</name>
            <value>66</value>
         </interrupt>
         <registers>
            <register>
               <name>SPW_ROUTER_STS</name>
               <description>SpW Router Status</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEST</name>
                     <description>Destination addr</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SOURCE</name>
                     <description>Source address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>BYTE</name>
                     <description>Router byte</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>COUNT</name>
                     <description>Packet Count</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_CFG</name>
               <description>SpW Router Config</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LAENA</name>
                     <description>LA Routing Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FALLBACK</name>
                     <description>Fallback Routing</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DISTIMEOUT</name>
                     <description>Disable Timeout</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TIMEOUT</name>
               <description>SpW Router Timeout</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Physical Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>LOCKED</name>
                     <description>Locked</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE0</name>
               <description>SpW Router Table (router_table_nb = 32) 0</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE1</name>
               <description>SpW Router Table (router_table_nb = 32) 1</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE2</name>
               <description>SpW Router Table (router_table_nb = 32) 2</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE3</name>
               <description>SpW Router Table (router_table_nb = 32) 3</description>
               <addressOffset>0x8C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE4</name>
               <description>SpW Router Table (router_table_nb = 32) 4</description>
               <addressOffset>0x90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE5</name>
               <description>SpW Router Table (router_table_nb = 32) 5</description>
               <addressOffset>0x94</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE6</name>
               <description>SpW Router Table (router_table_nb = 32) 6</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE7</name>
               <description>SpW Router Table (router_table_nb = 32) 7</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE8</name>
               <description>SpW Router Table (router_table_nb = 32) 8</description>
               <addressOffset>0xA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE9</name>
               <description>SpW Router Table (router_table_nb = 32) 9</description>
               <addressOffset>0xA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE10</name>
               <description>SpW Router Table (router_table_nb = 32) 10</description>
               <addressOffset>0xA8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE11</name>
               <description>SpW Router Table (router_table_nb = 32) 11</description>
               <addressOffset>0xAC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE12</name>
               <description>SpW Router Table (router_table_nb = 32) 12</description>
               <addressOffset>0xB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE13</name>
               <description>SpW Router Table (router_table_nb = 32) 13</description>
               <addressOffset>0xB4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE14</name>
               <description>SpW Router Table (router_table_nb = 32) 14</description>
               <addressOffset>0xB8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE15</name>
               <description>SpW Router Table (router_table_nb = 32) 15</description>
               <addressOffset>0xBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE16</name>
               <description>SpW Router Table (router_table_nb = 32) 16</description>
               <addressOffset>0xC0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE17</name>
               <description>SpW Router Table (router_table_nb = 32) 17</description>
               <addressOffset>0xC4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE18</name>
               <description>SpW Router Table (router_table_nb = 32) 18</description>
               <addressOffset>0xC8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE19</name>
               <description>SpW Router Table (router_table_nb = 32) 19</description>
               <addressOffset>0xCC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE20</name>
               <description>SpW Router Table (router_table_nb = 32) 20</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE21</name>
               <description>SpW Router Table (router_table_nb = 32) 21</description>
               <addressOffset>0xD4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE22</name>
               <description>SpW Router Table (router_table_nb = 32) 22</description>
               <addressOffset>0xD8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE23</name>
               <description>SpW Router Table (router_table_nb = 32) 23</description>
               <addressOffset>0xDC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE24</name>
               <description>SpW Router Table (router_table_nb = 32) 24</description>
               <addressOffset>0xE0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
