Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>SPW_ROUTER_TABLE83</name>
               <description>SpW Router Table (router_table_nb = 32) 83</description>
               <addressOffset>0x1CC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE84</name>
               <description>SpW Router Table (router_table_nb = 32) 84</description>
               <addressOffset>0x1D0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE85</name>
               <description>SpW Router Table (router_table_nb = 32) 85</description>
               <addressOffset>0x1D4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE86</name>
               <description>SpW Router Table (router_table_nb = 32) 86</description>
               <addressOffset>0x1D8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE87</name>
               <description>SpW Router Table (router_table_nb = 32) 87</description>
               <addressOffset>0x1DC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE88</name>
               <description>SpW Router Table (router_table_nb = 32) 88</description>
               <addressOffset>0x1E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE89</name>
               <description>SpW Router Table (router_table_nb = 32) 89</description>
               <addressOffset>0x1E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE90</name>
               <description>SpW Router Table (router_table_nb = 32) 90</description>
               <addressOffset>0x1E8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE91</name>
               <description>SpW Router Table (router_table_nb = 32) 91</description>
               <addressOffset>0x1EC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE92</name>
               <description>SpW Router Table (router_table_nb = 32) 92</description>
               <addressOffset>0x1F0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE93</name>
               <description>SpW Router Table (router_table_nb = 32) 93</description>
               <addressOffset>0x1F4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE94</name>
               <description>SpW Router Table (router_table_nb = 32) 94</description>
               <addressOffset>0x1F8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE95</name>
               <description>SpW Router Table (router_table_nb = 32) 95</description>
               <addressOffset>0x1FC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE96</name>
               <description>SpW Router Table (router_table_nb = 32) 96</description>
               <addressOffset>0x200</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE97</name>
               <description>SpW Router Table (router_table_nb = 32) 97</description>
               <addressOffset>0x204</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE98</name>
               <description>SpW Router Table (router_table_nb = 32) 98</description>
               <addressOffset>0x208</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE99</name>
               <description>SpW Router Table (router_table_nb = 32) 99</description>
               <addressOffset>0x20C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE100</name>
               <description>SpW Router Table (router_table_nb = 32) 100</description>
               <addressOffset>0x210</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE101</name>
               <description>SpW Router Table (router_table_nb = 32) 101</description>
               <addressOffset>0x214</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE102</name>
               <description>SpW Router Table (router_table_nb = 32) 102</description>
               <addressOffset>0x218</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE103</name>
               <description>SpW Router Table (router_table_nb = 32) 103</description>
               <addressOffset>0x21C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE104</name>
               <description>SpW Router Table (router_table_nb = 32) 104</description>
               <addressOffset>0x220</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE105</name>
               <description>SpW Router Table (router_table_nb = 32) 105</description>
               <addressOffset>0x224</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE106</name>
               <description>SpW Router Table (router_table_nb = 32) 106</description>
               <addressOffset>0x228</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE107</name>
               <description>SpW Router Table (router_table_nb = 32) 107</description>
               <addressOffset>0x22C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE108</name>
               <description>SpW Router Table (router_table_nb = 32) 108</description>
               <addressOffset>0x230</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE109</name>
               <description>SpW Router Table (router_table_nb = 32) 109</description>
               <addressOffset>0x234</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE110</name>
               <description>SpW Router Table (router_table_nb = 32) 110</description>
               <addressOffset>0x238</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE111</name>
               <description>SpW Router Table (router_table_nb = 32) 111</description>
               <addressOffset>0x23C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
