Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>SPW_ROUTER_TABLE141</name>
               <description>SpW Router Table (router_table_nb = 32) 141</description>
               <addressOffset>0x2B4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE142</name>
               <description>SpW Router Table (router_table_nb = 32) 142</description>
               <addressOffset>0x2B8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE143</name>
               <description>SpW Router Table (router_table_nb = 32) 143</description>
               <addressOffset>0x2BC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE144</name>
               <description>SpW Router Table (router_table_nb = 32) 144</description>
               <addressOffset>0x2C0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE145</name>
               <description>SpW Router Table (router_table_nb = 32) 145</description>
               <addressOffset>0x2C4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE146</name>
               <description>SpW Router Table (router_table_nb = 32) 146</description>
               <addressOffset>0x2C8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE147</name>
               <description>SpW Router Table (router_table_nb = 32) 147</description>
               <addressOffset>0x2CC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE148</name>
               <description>SpW Router Table (router_table_nb = 32) 148</description>
               <addressOffset>0x2D0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE149</name>
               <description>SpW Router Table (router_table_nb = 32) 149</description>
               <addressOffset>0x2D4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE150</name>
               <description>SpW Router Table (router_table_nb = 32) 150</description>
               <addressOffset>0x2D8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE151</name>
               <description>SpW Router Table (router_table_nb = 32) 151</description>
               <addressOffset>0x2DC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE152</name>
               <description>SpW Router Table (router_table_nb = 32) 152</description>
               <addressOffset>0x2E0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE153</name>
               <description>SpW Router Table (router_table_nb = 32) 153</description>
               <addressOffset>0x2E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE154</name>
               <description>SpW Router Table (router_table_nb = 32) 154</description>
               <addressOffset>0x2E8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE155</name>
               <description>SpW Router Table (router_table_nb = 32) 155</description>
               <addressOffset>0x2EC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE156</name>
               <description>SpW Router Table (router_table_nb = 32) 156</description>
               <addressOffset>0x2F0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE157</name>
               <description>SpW Router Table (router_table_nb = 32) 157</description>
               <addressOffset>0x2F4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE158</name>
               <description>SpW Router Table (router_table_nb = 32) 158</description>
               <addressOffset>0x2F8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE159</name>
               <description>SpW Router Table (router_table_nb = 32) 159</description>
               <addressOffset>0x2FC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE160</name>
               <description>SpW Router Table (router_table_nb = 32) 160</description>
               <addressOffset>0x300</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE161</name>
               <description>SpW Router Table (router_table_nb = 32) 161</description>
               <addressOffset>0x304</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE162</name>
               <description>SpW Router Table (router_table_nb = 32) 162</description>
               <addressOffset>0x308</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE163</name>
               <description>SpW Router Table (router_table_nb = 32) 163</description>
               <addressOffset>0x30C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE164</name>
               <description>SpW Router Table (router_table_nb = 32) 164</description>
               <addressOffset>0x310</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE165</name>
               <description>SpW Router Table (router_table_nb = 32) 165</description>
               <addressOffset>0x314</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE166</name>
               <description>SpW Router Table (router_table_nb = 32) 166</description>
               <addressOffset>0x318</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE167</name>
               <description>SpW Router Table (router_table_nb = 32) 167</description>
               <addressOffset>0x31C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE168</name>
               <description>SpW Router Table (router_table_nb = 32) 168</description>
               <addressOffset>0x320</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_ROUTER_TABLE169</name>
               <description>SpW Router Table (router_table_nb = 32) 169</description>
               <addressOffset>0x324</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>DELHEAD</name>
                     <description>Delete Header Byte</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
