Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
            <register>
               <name>SPW_RMAP1_STS</name>
               <description>SpW RMAP 1 Read Status</description>
               <addressOffset>0x00000E08</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ERRCODE</name>
                     <description>Error Code</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>ERRCODESelect</name>
                        <enumeratedValue>
                           <name>NOERROR</name>
                           <description>No error detected</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DMAERROR</name>
                           <description>Error while DMA accessing the internal bus, e.g. illegal address.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RMAPERROR</name>
                           <description>Unused RMAP command according to [RMAP]</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DESTKEYERROR</name>
                           <description>Destination key error</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATACRCERROR</name>
                           <description>Data CRC error</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOPERROR</name>
                           <description>Early EOP in header or data, i.e. EOP has been received with less data than expected from the RMAP command header.</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CARGOERROR</name>
                           <description>Cargo too large. Late EOP or EEP in data, i.e. EOP/EEP has been received with more data than expected from the RMAP command header.</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EEPERROR</name>
                           <description>Early EEP in data for RMAP commands. EEP has been received with less data or exactly as much as expected from the RMAP command header.</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CMDERROR</name>
                           <description>Authorisation error:Invalid or unsupported command.</description>
                           <value>0xA</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TLAERROR</name>
                           <description>Non-matching Target Logical Address.</description>
                           <value>0xC</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HEADERCRCERROR</name>
                           <description>Incorrect header CRC.</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PROTOCOLIDERROR</name>
                           <description>Protocol Identifier not supported.</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REPLYADDERROR</name>
                           <description>Unsupported reply address length</description>
                           <value>0x12</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VALID</name>
                     <description>Valid</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_RM</name>
               <description>SpW Tch Pending Read Masked Interrupt</description>
               <addressOffset>0x00000E80</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_RCM</name>
               <description>SpW Tch Pending Read and Clear Masked Interrupt</description>
               <addressOffset>0x00000E84</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_R</name>
               <description>SpW Tch Pending Read Interrupt</description>
               <addressOffset>0x00000E88</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_RCS</name>
               <description>SpW Tch Pending Read, Clear and Enabled Interrupt</description>
               <addressOffset>0x00000E8C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM</name>
               <description>SpW Tch Interrupt Mask</description>
               <addressOffset>0x00000E90</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_PI_C</name>
               <description>SpW Tch Clear Pending Interrupt</description>
               <addressOffset>0x00000E94</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM_S</name>
               <description>SpW Tch Interrupt Set Mask</description>
               <addressOffset>0x00000E98</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_IM_C</name>
               <description>SpW Tch Interrupt Clear Mask</description>
               <addressOffset>0x00000E9C</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>TCEVENT</name>
                     <description>TcEvent</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIMECODE</name>
                     <description>Time Code</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANYTIMECODE</name>
                     <description>Any Time Code</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LATEWD</name>
                     <description>Late Watchdog</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EARLYWD</name>
                     <description>Early Watchdog</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGLISTEN</name>
               <description>SpW Tch Config Listener</description>
               <addressOffset>0x00000EA0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>L1</name>
                     <description>Listen  link 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>L2</name>
                     <description>Listen link 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGSEND</name>
               <description>SpW Tch Config Sender</description>
               <addressOffset>0x00000EA4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>S1</name>
                     <description>Send link 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>S2</name>
                     <description>Send link 2</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFG</name>
               <description>SpW Tch Config</description>
               <addressOffset>0x00000EA8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EVENT</name>
                     <description>Event</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGRESTART</name>
               <description>SpW Tch Config Restart</description>
               <addressOffset>0x00000EAC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>EVENT</name>
                     <description>Event</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PPS</name>
                     <description>Pps</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONESHOT</name>
                     <description>One Shot</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGTCEVENT</name>
               <description>SpW Tch Config Tc Event</description>
               <addressOffset>0x00000EB0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Mask</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_CFGWD</name>
               <description>SpW Tch Config Watchdog</description>
               <addressOffset>0x00000EB4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LATE</name>
                     <description>Late</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>EARLY</name>
                     <description>Early</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_LASTTIMECODE</name>
               <description>SpW Tch Last Time Code</description>
               <addressOffset>0x00000EB8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>SEND</name>
                     <description>Send Now</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SPW_TCH_SWRESET</name>
               <description>SpW Tch Software Reset</description>
               <addressOffset>0x00000EBC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PATTERN</name>
                     <description>Pattern</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
