Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMRH71_DFP/0.1.26/svd/ATSAMRH71F20B.svd
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_TX</name>
                              <description>QSPI_TX</description>
                              <value>20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_RX</name>
                              <description>QSPI_RX</description>
                              <value>21</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM0</name>
                              <description>PWM0</description>
                              <value>22</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM1</name>
                              <description>PWM1</description>
                              <value>23</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC0</name>
                              <description>TC0</description>
                              <value>24</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1</name>
                              <description>TC1</description>
                              <value>25</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC2</name>
                              <description>TC2</description>
                              <value>26</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC3</name>
                              <description>TC3</description>
                              <value>27</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SHA</name>
                              <description>SHA</description>
                              <value>28</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_CPA</name>
                              <description>TC1_CPA</description>
                              <value>29</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_CPA</name>
                              <description>TC4_CPA</description>
                              <value>30</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_CPA</name>
                              <description>TC7_CPA</description>
                              <value>31</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC10_CPA</name>
                              <description>TC10_CPA</description>
                              <value>32</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_CPB</name>
                              <description>TC1_CPB</description>
                              <value>33</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_CPB</name>
                              <description>TC4_CPB</description>
                              <value>34</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_CPB</name>
                              <description>TC7_CPB</description>
                              <value>35</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC10_CPB</name>
                              <description>TC10_CPB</description>
                              <value>36</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_CPC</name>
                              <description>TC1_CPC</description>
                              <value>37</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_CPC</name>
                              <description>TC4_CPC</description>
                              <value>38</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_CPC</name>
                              <description>TC7_CPC</description>
                              <value>39</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC10_CPC</name>
                              <description>TC10_CPC</description>
                              <value>40</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC1_ETRG</name>
                              <description>TC1_ETRG</description>
                              <value>41</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC4_ETRG</name>
                              <description>TC4_ETRG</description>
                              <value>42</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC7_ETRG</name>
                              <description>TC7_ETRG</description>
                              <value>43</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TC10_ETRG</name>
                              <description>TC10_ETRG</description>
                              <value>44</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDS_MSP</name>
                  <description>Channel Data Stride Memory Set Pattern</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SDS_MSP</name>
                        <description>Channel x Source Data stride or Memory Set Pattern</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DDS_MSP</name>
                        <description>Channel x Destination Data Stride or Memory Set Pattern</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CSUS</name>
                  <description>Channel Source Microblock Stride</description>
                  <addressOffset>0x30</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SUBS</name>
                        <description>Channel x Source Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDUS</name>
                  <description>Channel Destination Microblock Stride</description>
                  <addressOffset>0x34</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DUBS</name>
                        <description>Channel x Destination Microblock Stride</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
